; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	spectrograph1 - mode
	thermograph0 - mode
	spectrograph2 - mode
	GroundStation4 - direction
	Star2 - direction
	Star3 - direction
	Star1 - direction
	Star0 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Planet14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
	Star20 - direction
	Phenomenon21 - direction
	Planet22 - direction
	Star23 - direction
	Planet24 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph2)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 thermograph0)
	(supports instrument1 spectrograph1)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 GroundStation4)
	(supports instrument3 thermograph0)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 Star0)
	(supports instrument4 spectrograph2)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star2)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet11)
	(supports instrument5 spectrograph2)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 Star3)
	(supports instrument6 spectrograph1)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star0)
	(supports instrument7 spectrograph2)
	(calibration_target instrument7 Star3)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet12)
	(supports instrument8 spectrograph1)
	(supports instrument8 spectrograph2)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 Star2)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument9 spectrograph2)
	(calibration_target instrument9 Star3)
	(supports instrument10 spectrograph2)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 Star1)
	(supports instrument11 spectrograph2)
	(calibration_target instrument11 Star0)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet11)
)
(:goal (and
	(pointing satellite0 Star23)
	(pointing satellite3 Phenomenon18)
	(have_image Star5 spectrograph2)
	(have_image Phenomenon6 spectrograph2)
	(have_image Planet8 spectrograph2)
	(have_image Planet9 spectrograph1)
	(have_image Planet10 thermograph0)
	(have_image Planet14 spectrograph2)
	(have_image Phenomenon15 thermograph0)
	(have_image Planet16 spectrograph1)
	(have_image Phenomenon19 thermograph0)
	(have_image Star20 spectrograph1)
	(have_image Phenomenon21 thermograph0)
	(have_image Planet22 spectrograph2)
	(have_image Star23 spectrograph2)
	(have_image Planet24 thermograph0)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 16
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 16
3. (turn_to satellite4 phenomenon15 planet11)
   deleted: (pointing satellite4 planet11)
   added: (pointing satellite4 phenomenon15)
   goals met: 0 of 16
4. (turn_to satellite4 star1 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 star1)
   goals met: 0 of 16
5. (calibrate satellite4 instrument10 star1)
   added: (calibrated instrument10)
   goals met: 0 of 16
6. (turn_to satellite4 phenomenon15 star1)
   deleted: (pointing satellite4 star1)
   added: (pointing satellite4 phenomenon15)
   goals met: 0 of 16
7. (take_image satellite4 phenomenon15 instrument10 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 1 of 16
8. (turn_to satellite4 phenomenon19 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 phenomenon19)
   goals met: 1 of 16
9. (take_image satellite4 phenomenon19 instrument10 thermograph0)
   added: (have_image phenomenon19 thermograph0)
   goals met: 2 of 16
10. (turn_to satellite4 phenomenon21 phenomenon19)
   deleted: (pointing satellite4 phenomenon19)
   added: (pointing satellite4 phenomenon21)
   goals met: 2 of 16
11. (take_image satellite4 phenomenon21 instrument10 thermograph0)
   added: (have_image phenomenon21 thermograph0)
   goals met: 3 of 16
12. (turn_to satellite4 phenomenon6 phenomenon21)
   deleted: (pointing satellite4 phenomenon21)
   added: (pointing satellite4 phenomenon6)
   goals met: 3 of 16
13. (take_image satellite4 phenomenon6 instrument10 spectrograph2)
   added: (have_image phenomenon6 spectrograph2)
   goals met: 4 of 16
14. (turn_to satellite4 planet10 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 planet10)
   goals met: 4 of 16
15. (take_image satellite4 planet10 instrument10 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 5 of 16
16. (turn_to satellite4 planet14 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 planet14)
   goals met: 5 of 16
17. (take_image satellite4 planet14 instrument10 spectrograph2)
   added: (have_image planet14 spectrograph2)
   goals met: 6 of 16
18. (turn_to satellite4 planet22 planet14)
   deleted: (pointing satellite4 planet14)
   added: (pointing satellite4 planet22)
   goals met: 6 of 16
19. (take_image satellite4 planet22 instrument10 spectrograph2)
   added: (have_image planet22 spectrograph2)
   goals met: 7 of 16
20. (turn_to satellite4 planet24 planet22)
   deleted: (pointing satellite4 planet22)
   added: (pointing satellite4 planet24)
   goals met: 7 of 16
21. (take_image satellite4 planet24 instrument10 thermograph0)
   added: (have_image planet24 thermograph0)
   goals met: 8 of 16
22. (turn_to satellite4 planet8 planet24)
   deleted: (pointing satellite4 planet24)
   added: (pointing satellite4 planet8)
   goals met: 8 of 16
23. (take_image satellite4 planet8 instrument10 spectrograph2)
   added: (have_image planet8 spectrograph2)
   goals met: 9 of 16
24. (turn_to satellite4 star23 planet8)
   deleted: (pointing satellite4 planet8)
   added: (pointing satellite4 star23)
   goals met: 9 of 16
25. (take_image satellite4 star23 instrument10 spectrograph2)
   added: (have_image star23 spectrograph2)
   goals met: 10 of 16
26. (turn_to satellite4 star5 star23)
   deleted: (pointing satellite4 star23)
   added: (pointing satellite4 star5)
   goals met: 10 of 16
27. (take_image satellite4 star5 instrument10 spectrograph2)
   added: (have_image star5 spectrograph2)
   goals met: 11 of 16
28. (turn_to satellite3 phenomenon18 star5)
   deleted: (pointing satellite3 star5)
   added: (pointing satellite3 phenomenon18)
   goals met: 12 of 16
29. (turn_to satellite0 groundstation4 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation4)
   goals met: 12 of 16
30. (calibrate satellite0 instrument0 groundstation4)
   added: (calibrated instrument0)
   goals met: 12 of 16
31. (turn_to satellite0 planet16 groundstation4)
   deleted: (pointing satellite0 groundstation4)
   added: (pointing satellite0 planet16)
   goals met: 12 of 16
32. (take_image satellite0 planet16 instrument0 spectrograph1)
   added: (have_image planet16 spectrograph1)
   goals met: 13 of 16
33. (turn_to satellite0 planet9 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet9)
   goals met: 13 of 16
34. (take_image satellite0 planet9 instrument0 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 14 of 16
35. (turn_to satellite0 star20 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star20)
   goals met: 14 of 16
36. (take_image satellite0 star20 instrument0 spectrograph1)
   added: (have_image star20 spectrograph1)
   goals met: 15 of 16
37. (turn_to satellite0 star23 star20)
   deleted: (pointing satellite0 star20)
   added: (pointing satellite0 star23)
   goals met: 16 of 16
